ahtn/keyplus/ports/efm8/efm8/mcu/C8051F410/inc/SI_C8051F410_Register_Enums.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F410_GQ
//  C8051F411_GM
//  C8051F412_GQ
//  C8051F413_GM
//  C8051F414_GQ
//  C8051F415_GM
//  C8051F416_GQ
//  C8051F417_GM

#ifndef SI_C8051F410_REGISTER_ENUMS_H
#define SI_C8051F410_REGISTER_ENUMS_H

//Standard device includes
#include "SI_C8051F410_Defs.h"
//------------------------------------------------------------------------------
// ADC0CF Enums (ADC0 Configuration @ 0xBC)
//------------------------------------------------------------------------------
#define ADC0CF_ADRPT__FMASK  0x06 ///< Repeat Count                          
#define ADC0CF_ADRPT__SHIFT  0x01 ///< Repeat Count                          
#define ADC0CF_ADRPT__ACC_1  0x00 ///< Perform and Accumulate 1 conversion.  
#define ADC0CF_ADRPT__ACC_4  0x02 ///< Perform and Accumulate 4 conversions. 
#define ADC0CF_ADRPT__ACC_8  0x04 ///< Perform and Accumulate 8 conversions. 
#define ADC0CF_ADRPT__ACC_16 0x06 ///< Perform and Accumulate 16 conversions.
                                                                             
#define ADC0CF_ADSC__FMASK   0xF8 ///< SAR Clock Divider                     
#define ADC0CF_ADSC__SHIFT   0x03 ///< SAR Clock Divider                     
                                                                             
//------------------------------------------------------------------------------
// ADC0CN Enums (ADC0 Control @ 0xE8)
//------------------------------------------------------------------------------
#define ADC0CN_ADCM__FMASK            0x03 ///< Start of Conversion Mode Select                   
#define ADC0CN_ADCM__SHIFT            0x00 ///< Start of Conversion Mode Select                   
#define ADC0CN_ADCM__ADBUSY           0x00 ///< ADC0 conversion initiated on write of 1 to ADBUSY.
#define ADC0CN_ADCM__TIMER3           0x01 ///< ADC0 conversion initiated on overflow of Timer 3. 
#define ADC0CN_ADCM__CNVSTR           0x02 ///< ADC0 conversion initiated on rising edge of       
                                           ///< CNVSTR.                                           
#define ADC0CN_ADCM__TIMER2           0x03 ///< ADC0 conversion initiated on overflow of Timer 2. 
                                                                                                  
#define ADC0CN_ADLJST__BMASK          0x04 ///< Justification Select                              
#define ADC0CN_ADLJST__SHIFT          0x02 ///< Justification Select                              
#define ADC0CN_ADLJST__RIGHT          0x00 ///< Data in ADC0H:L is right-justified.               
#define ADC0CN_ADLJST__LEFT           0x04 ///< Data in ADC0H:L is left-justified. This option    
                                           ///< should not be used with a repeat count greater    
                                           ///< than 1 (ADRPT set to any value other than 0).     
                                                                                                  
#define ADC0CN_ADWINT__BMASK          0x08 ///< Window Compare Interrupt Flag                     
#define ADC0CN_ADWINT__SHIFT          0x03 ///< Window Compare Interrupt Flag                     
#define ADC0CN_ADWINT__NOT_SET        0x00 ///< An ADC window compare event did not occur.        
#define ADC0CN_ADWINT__SET            0x08 ///< An ADC window compare event occurred.             
                                                                                                  
#define ADC0CN_ADBUSY__BMASK          0x10 ///< ADC Busy                                          
#define ADC0CN_ADBUSY__SHIFT          0x04 ///< ADC Busy                                          
#define ADC0CN_ADBUSY__NOT_SET        0x00 ///< An ADC0 conversion is not currently in progress.  
#define ADC0CN_ADBUSY__SET            0x10 ///< ADC0 conversion is in progress or start an ADC0   
                                           ///< conversion.                                       
                                                                                                  
#define ADC0CN_ADINT__BMASK           0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__SHIFT           0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__NOT_SET         0x00 ///< ADC0 has not completed a conversion since the last
                                           ///< time ADINT was cleared.                           
#define ADC0CN_ADINT__SET             0x20 ///< ADC0 completed a data conversion.                 
                                                                                                  
#define ADC0CN_ADBMEN__BMASK          0x40 ///< Burst Mode Enable                                 
#define ADC0CN_ADBMEN__SHIFT          0x06 ///< Burst Mode Enable                                 
#define ADC0CN_ADBMEN__BURST_DISABLED 0x00 ///< Disable ADC0 Burst Mode.                          
#define ADC0CN_ADBMEN__BURST_ENABLED  0x40 ///< Enable ADC0 Burst Mode.                           
                                                                                                  
#define ADC0CN_ADEN__BMASK            0x80 ///< ADC Enable                                        
#define ADC0CN_ADEN__SHIFT            0x07 ///< ADC Enable                                        
#define ADC0CN_ADEN__DISABLED         0x00 ///< Disable ADC0 (low-power shutdown).                
#define ADC0CN_ADEN__ENABLED          0x80 ///< Enable ADC0 (active and ready for data            
                                           ///< conversions).                                     
                                                                                                  
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xBD)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// ADC0MX Enums (ADC0 Multiplexer Selection @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0MX_ADC0MX__FMASK   0x1F ///< AMUX Positive Input Selection
#define ADC0MX_ADC0MX__SHIFT   0x00 ///< AMUX Positive Input Selection
#define ADC0MX_ADC0MX__ADC0P0  0x00 ///< Select channel ADC0.0.       
#define ADC0MX_ADC0MX__ADC0P1  0x01 ///< Select channel ADC0.1.       
#define ADC0MX_ADC0MX__ADC0P2  0x02 ///< Select channel ADC0.2.       
#define ADC0MX_ADC0MX__ADC0P3  0x03 ///< Select channel ADC0.3.       
#define ADC0MX_ADC0MX__ADC0P4  0x04 ///< Select channel ADC0.4.       
#define ADC0MX_ADC0MX__ADC0P5  0x05 ///< Select channel ADC0.5.       
#define ADC0MX_ADC0MX__ADC0P6  0x06 ///< Select channel ADC0.6.       
#define ADC0MX_ADC0MX__ADC0P7  0x07 ///< Select channel ADC0.7.       
#define ADC0MX_ADC0MX__ADC0P8  0x08 ///< Select channel ADC0.8.       
#define ADC0MX_ADC0MX__ADC0P9  0x09 ///< Select channel ADC0.9.       
#define ADC0MX_ADC0MX__ADC0P10 0x0A ///< Select channel ADC0.10.      
#define ADC0MX_ADC0MX__ADC0P11 0x0B ///< Select channel ADC0.11.      
#define ADC0MX_ADC0MX__ADC0P12 0x0C ///< Select channel ADC0.12.      
#define ADC0MX_ADC0MX__ADC0P13 0x0D ///< Select channel ADC0.13.      
#define ADC0MX_ADC0MX__ADC0P14 0x0E ///< Select channel ADC0.14.      
#define ADC0MX_ADC0MX__ADC0P15 0x0F ///< Select channel ADC0.15.      
#define ADC0MX_ADC0MX__ADC0P16 0x10 ///< Select channel ADC0.16.      
#define ADC0MX_ADC0MX__ADC0P17 0x11 ///< Select channel ADC0.17.      
#define ADC0MX_ADC0MX__ADC0P18 0x12 ///< Select channel ADC0.18.      
#define ADC0MX_ADC0MX__ADC0P19 0x13 ///< Select channel ADC0.19.      
#define ADC0MX_ADC0MX__ADC0P20 0x14 ///< Select channel ADC0.20.      
#define ADC0MX_ADC0MX__ADC0P21 0x15 ///< Select channel ADC0.21.      
#define ADC0MX_ADC0MX__ADC0P22 0x16 ///< Select channel ADC0.22.      
#define ADC0MX_ADC0MX__ADC0P23 0x17 ///< Select channel ADC0.23.      
#define ADC0MX_ADC0MX__TEMP    0x18 ///< Temperature Sensor.          
#define ADC0MX_ADC0MX__VDD     0x19 ///< VDD Supply Voltage.          
#define ADC0MX_ADC0MX__GND     0x1F ///< Ground.                      
                                                                      
//------------------------------------------------------------------------------
// ADC0TK Enums (ADC0 Burst Mode Track Time @ 0xBA)
//------------------------------------------------------------------------------
#define ADC0TK_ADTK__FMASK         0x03 ///< Post Tracking Time                                
#define ADC0TK_ADTK__SHIFT         0x00 ///< Post Tracking Time                                
#define ADC0TK_ADTK__2_SAR_CLOCKS  0x00 ///< Post-Tracking time is equal to 2 SAR clock cycles 
                                        ///< + 2 FADCCLK cycles.                               
#define ADC0TK_ADTK__4_SAR_CLOCKS  0x01 ///< Post-Tracking time is equal to 4 SAR clock cycles 
                                        ///< + 2 FADCCLK cycles.                               
#define ADC0TK_ADTK__8_SAR_CLOCKS  0x02 ///< Post-Tracking time is equal to 8 SAR clock cycles 
                                        ///< + 2 FADCCLK cycles.                               
#define ADC0TK_ADTK__16_SAR_CLOCKS 0x03 ///< Post-Tracking time is equal to 16 SAR clock cycles
                                        ///< + 2 FADCCLK cycles.                               
                                                                                               
#define ADC0TK_ADTM__FMASK         0x0C ///< Tracking Mode                                     
#define ADC0TK_ADTM__SHIFT         0x02 ///< Tracking Mode                                     
#define ADC0TK_ADTM__POST_TRACKING 0x04 ///< ADC0 is configured to Post-Tracking Mode.         
#define ADC0TK_ADTM__PRE_TRACKING  0x08 ///< ADC0 is configured to Pre-Tracking Mode.          
#define ADC0TK_ADTM__DUAL_TRACKING 0x0C ///< ADC0 is configured to Dual-Tracking Mode.         
                                                                                               
#define ADC0TK_ADPWR__FMASK        0xF0 ///< Burst Mode Power Up Time                          
#define ADC0TK_ADPWR__SHIFT        0x04 ///< Burst Mode Power Up Time                          
                                                                                               
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
