ahtn/keyplus/ports/efm8/efm8/mcu/C8051F410/inc/SI_C8051F410_Register_Enums.h
#define PSW_OV__BMASK       0x04 ///< Overflow Flag                                     
#define PSW_OV__SHIFT       0x02 ///< Overflow Flag                                     
#define PSW_OV__NOT_SET     0x00 ///< An overflow did not occur.                        
#define PSW_OV__SET         0x04 ///< An overflow occurred.                             
                                                                                        
#define PSW_RS__FMASK       0x18 ///< Register Bank Select                              
#define PSW_RS__SHIFT       0x03 ///< Register Bank Select                              
#define PSW_RS__BANK0       0x00 ///< Bank 0, Addresses 0x00-0x07                       
#define PSW_RS__BANK1       0x08 ///< Bank 1, Addresses 0x08-0x0F                       
#define PSW_RS__BANK2       0x10 ///< Bank 2, Addresses 0x10-0x17                       
#define PSW_RS__BANK3       0x18 ///< Bank 3, Addresses 0x18-0x1F                       
                                                                                        
#define PSW_F0__BMASK       0x20 ///< User Flag 0                                       
#define PSW_F0__SHIFT       0x05 ///< User Flag 0                                       
#define PSW_F0__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F0__SET         0x20 ///< Flag is set.                                      
                                                                                        
#define PSW_AC__BMASK       0x40 ///< Auxiliary Carry Flag                              
#define PSW_AC__SHIFT       0x06 ///< Auxiliary Carry Flag                              
#define PSW_AC__NOT_SET     0x00 ///< A carry into (addition) or borrow from            
                                 ///< (subtraction) the high order nibble did not occur.
#define PSW_AC__SET         0x40 ///< A carry into (addition) or borrow from            
                                 ///< (subtraction) the high order nibble occurred.     
                                                                                        
#define PSW_CY__BMASK       0x80 ///< Carry Flag                                        
#define PSW_CY__SHIFT       0x07 ///< Carry Flag                                        
#define PSW_CY__NOT_SET     0x00 ///< A carry (addition) or borrow (subtraction) did not
                                 ///< occur.                                            
#define PSW_CY__SET         0x80 ///< A carry (addition) or borrow (subtraction)        
                                 ///< occurred.                                         
                                                                                        
//------------------------------------------------------------------------------
// SP Enums (Stack Pointer @ 0x81)
//------------------------------------------------------------------------------
#define SP_SP__FMASK 0xFF ///< Stack Pointer
#define SP_SP__SHIFT 0x00 ///< Stack Pointer
                                            
//------------------------------------------------------------------------------
// CLKMUL Enums (Clock Multiplier Control @ 0xAB)
//------------------------------------------------------------------------------
#define CLKMUL_MULSEL__FMASK            0x03 ///< Clock Multiplier Input Select                     
#define CLKMUL_MULSEL__SHIFT            0x00 ///< Clock Multiplier Input Select                     
#define CLKMUL_MULSEL__HFOSC_DIV_2      0x00 ///< Clock Multiplier input clock source is the        
                                             ///< Internal High-Frequency Oscillator / 2.           
#define CLKMUL_MULSEL__EXTOSC           0x01 ///< Clock Multiplier input clock source is the        
                                             ///< External Oscillator.                              
#define CLKMUL_MULSEL__EXTOSC_DIV_2     0x02 ///< Clock Multiplier input clock source is the        
                                             ///< External Oscillator / 2.                          
#define CLKMUL_MULSEL__HFOSC            0x03 ///< Clock Multiplier input clock source is the        
                                             ///< Internal High-Frequency Oscillator.               
                                                                                                    
#define CLKMUL_MULDIV__FMASK            0x1C ///< Clock Multiplier Output Scaling Factor            
#define CLKMUL_MULDIV__SHIFT            0x02 ///< Clock Multiplier Output Scaling Factor            
#define CLKMUL_MULDIV__DIV_ONE          0x00 ///< Clock Multiplier Output scaled by a factor of 1.  
#define CLKMUL_MULDIV__DIV_TWO_THIRDS   0x0C ///< Clock Multiplier Output scaled by a factor of 2/3.
#define CLKMUL_MULDIV__DIV_HALF         0x10 ///< Clock Multiplier Output scaled by a factor of 2/4 
                                             ///< (or 1/2).                                         
#define CLKMUL_MULDIV__DIV_TWO_FIFTHS   0x14 ///< Clock Multiplier Output scaled by a factor of 2/5.
#define CLKMUL_MULDIV__DIV_ONE_THIRD    0x18 ///< Clock Multiplier Output scaled by a factor of 2/6 
                                             ///< (or 1/3).                                         
#define CLKMUL_MULDIV__DIV_TWO_SEVENTHS 0x1C ///< Clock Multiplier Output scaled by a factor of 2/7.
                                                                                                    
#define CLKMUL_MULRDY__BMASK            0x20 ///< Clock Multiplier Ready                            
#define CLKMUL_MULRDY__SHIFT            0x05 ///< Clock Multiplier Ready                            
#define CLKMUL_MULRDY__NOT_SET          0x00 ///< Clock Multiplier not ready.                       
#define CLKMUL_MULRDY__SET              0x20 ///< Clock Multiplier is ready (locked).               
                                                                                                    
