ahtn/keyplus/ports/efm8/efm8/mcu/C8051F410/inc/SI_C8051F410_Register_Enums.h
#define CPT1CN_CPOUT__BMASK                0x40 ///< Comparator Output State Flag                      
#define CPT1CN_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag                      
#define CPT1CN_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP1P < CP1N.                           
#define CPT1CN_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP1P > CP1N.                           
                                                                                                       
#define CPT1CN_CPEN__BMASK                 0x80 ///< Comparator Enable                                 
#define CPT1CN_CPEN__SHIFT                 0x07 ///< Comparator Enable                                 
#define CPT1CN_CPEN__DISABLED              0x00 ///< Comparator disabled.                              
#define CPT1CN_CPEN__ENABLED               0x80 ///< Comparator enabled.                               
                                                                                                       
//------------------------------------------------------------------------------
// CPT1MD Enums (Comparator 1 Mode @ 0x9C)
//------------------------------------------------------------------------------
#define CPT1MD_CPMD__FMASK              0x03 ///< Comparator Mode Select                      
#define CPT1MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select                      
#define CPT1MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power
                                             ///< Consumption)                                
#define CPT1MD_CPMD__MODE1              0x01 ///< Mode 1                                      
#define CPT1MD_CPMD__MODE2              0x02 ///< Mode 2                                      
#define CPT1MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power 
                                             ///< Consumption)                                
                                                                                              
#define CPT1MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT1MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT1MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled. 
#define CPT1MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.  
                                                                                              
#define CPT1MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT1MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT1MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.  
#define CPT1MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.   
                                                                                              
//------------------------------------------------------------------------------
// CPT1MX Enums (Comparator 1 Multiplexer Selection @ 0x9E)
//------------------------------------------------------------------------------
#define CPT1MX_CMXP__FMASK   0x0F ///< Comparator Positive Input MUX Selection
#define CPT1MX_CMXP__SHIFT   0x00 ///< Comparator Positive Input MUX Selection
#define CPT1MX_CMXP__CMP1P0  0x00 ///< External pin CMP1P.0.                  
#define CPT1MX_CMXP__CMP1P1  0x01 ///< External pin CMP1P.1.                  
#define CPT1MX_CMXP__CMP1P2  0x02 ///< External pin CMP1P.2.                  
#define CPT1MX_CMXP__CMP1P3  0x03 ///< External pin CMP1P.3.                  
#define CPT1MX_CMXP__CMP1P4  0x04 ///< External pin CMP1P.4.                  
#define CPT1MX_CMXP__CMP1P5  0x05 ///< External pin CMP1P.5.                  
#define CPT1MX_CMXP__CMP1P6  0x06 ///< External pin CMP1P.6.                  
#define CPT1MX_CMXP__CMP1P7  0x07 ///< External pin CMP1P.7.                  
#define CPT1MX_CMXP__CMP1P8  0x08 ///< External pin CMP1P.8.                  
#define CPT1MX_CMXP__CMP1P9  0x09 ///< External pin CMP1P.9.                  
#define CPT1MX_CMXP__CMP1P10 0x0A ///< External pin CMP1P.10.                 
#define CPT1MX_CMXP__CMP1P11 0x0B ///< External pin CMP1P.11.                 
#define CPT1MX_CMXP__NONE    0x0F ///< No input selected.                     
                                                                              
#define CPT1MX_CMXN__FMASK   0xF0 ///< Comparator Negative Input MUX Selection
#define CPT1MX_CMXN__SHIFT   0x04 ///< Comparator Negative Input MUX Selection
#define CPT1MX_CMXN__CMP1N0  0x00 ///< External pin CMP1N.0.                  
#define CPT1MX_CMXN__CMP1N1  0x10 ///< External pin CMP1N.1.                  
#define CPT1MX_CMXN__CMP1N2  0x20 ///< External pin CMP1N.2.                  
#define CPT1MX_CMXN__CMP1N3  0x30 ///< External pin CMP1N.3.                  
#define CPT1MX_CMXN__CMP1N4  0x40 ///< External pin CMP1N.4.                  
#define CPT1MX_CMXN__CMP1N5  0x50 ///< External pin CMP1N.5.                  
#define CPT1MX_CMXN__CMP1N6  0x60 ///< External pin CMP1N.6.                  
#define CPT1MX_CMXN__CMP1N7  0x70 ///< External pin CMP1N.7.                  
#define CPT1MX_CMXN__CMP1N8  0x80 ///< External pin CMP1N.8.                  
#define CPT1MX_CMXN__CMP1N9  0x90 ///< External pin CMP1N.9.                  
#define CPT1MX_CMXN__CMP1N10 0xA0 ///< External pin CMP1N.10.                 
#define CPT1MX_CMXN__CMP1N11 0xB0 ///< External pin CMP1N.11.                 
#define CPT1MX_CMXN__NONE    0xF0 ///< No input selected.                     
                                                                              
//------------------------------------------------------------------------------
// CRC0CN Enums (CRC0 Control @ 0x84)
//------------------------------------------------------------------------------
#define CRC0CN_CRCPNT__FMASK        0x03 ///< CRC Result Pointer                                
#define CRC0CN_CRCPNT__SHIFT        0x00 ///< CRC Result Pointer                                
#define CRC0CN_CRCPNT__ACCESS_B0    0x00 ///< CRC0DAT accesses bits 7-0 of the 16-bit or 32-bit 
                                         ///< CRC result.                                       
#define CRC0CN_CRCPNT__ACCESS_B1    0x01 ///< CRC0DAT accesses bits 15-8 of the 16-bit or 32-bit
                                         ///< CRC result.                                       
#define CRC0CN_CRCPNT__ACCESS_B2    0x02 ///< CRC0DAT accesses bits 7-0 of the 16-bit or bits   
                                         ///< 23-15 of the 32-bit CRC result.                   
#define CRC0CN_CRCPNT__ACCESS_B3    0x03 ///< CRC0DAT accesses bits 15-8 of the 16-bit or bits  
                                         ///< 31-24 of the 32-bit CRC result.                   
                                                                                                
#define CRC0CN_CRCVAL__BMASK        0x04 ///< CRC Initialization Value                          
#define CRC0CN_CRCVAL__SHIFT        0x02 ///< CRC Initialization Value                          
#define CRC0CN_CRCVAL__SET_ZEROES   0x00 ///< CRC result is set to 0x00000000 on write of 1 to  
                                         ///< CRCINIT.                                          
#define CRC0CN_CRCVAL__SET_ONES     0x04 ///< CRC result is set to 0xFFFFFFFF on write of 1 to  
                                         ///< CRCINIT.                                          
                                                                                                
#define CRC0CN_CRCINIT__BMASK       0x08 ///< CRC Initialization Enable                         
#define CRC0CN_CRCINIT__SHIFT       0x03 ///< CRC Initialization Enable                         
#define CRC0CN_CRCINIT__DO_NOT_INIT 0x00 ///< Do not initialize the CRC result.                 
#define CRC0CN_CRCINIT__INIT        0x08 ///< Initialize the CRC result to ones or zeroes vased 
                                         ///< on the value of CRCVAL.                           
                                                                                                
#define CRC0CN_POLYSEL__BMASK       0x10 ///< CRC Polynomial Select Bit                         
#define CRC0CN_POLYSEL__SHIFT       0x04 ///< CRC Polynomial Select Bit                         
#define CRC0CN_POLYSEL__32_BIT      0x00 ///< Use the 32-bit polynomial 0x04C11DB7 for          
                                         ///< calculating the CRC result.                       
#define CRC0CN_POLYSEL__16_BIT      0x10 ///< Use the 16-bit polynomial 0x1021 for calculating  
                                         ///< the CRC result.                                   
                                                                                                
//------------------------------------------------------------------------------
// CRC0DAT Enums (CRC0 Data Output @ 0x86)
//------------------------------------------------------------------------------
#define CRC0DAT_CRC0DAT__FMASK 0xFF ///< CRC Data Output
#define CRC0DAT_CRC0DAT__SHIFT 0x00 ///< CRC Data Output
                                                        
//------------------------------------------------------------------------------
// CRC0FLIP Enums (CRC0 Bit Flip @ 0xDF)
//------------------------------------------------------------------------------
#define CRC0FLIP_CRC0FLIP__FMASK 0xFF ///< CRC0 Bit Flip
#define CRC0FLIP_CRC0FLIP__SHIFT 0x00 ///< CRC0 Bit Flip
                                                        
//------------------------------------------------------------------------------
// CRC0IN Enums (CRC0 Data Input @ 0x85)
//------------------------------------------------------------------------------
#define CRC0IN_CRC0IN__FMASK 0xFF ///< CRC Data Input
#define CRC0IN_CRC0IN__SHIFT 0x00 ///< CRC Data Input
                                                     
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
