ahtn/keyplus/ports/efm8/efm8/mcu/C8051F410/inc/SI_C8051F410_Register_Enums.h
#define PFE0CN_PFEN__BMASK                 0x20 ///< Prefetch Enable                                
#define PFE0CN_PFEN__SHIFT                 0x05 ///< Prefetch Enable                                
#define PFE0CN_PFEN__DISABLED              0x00 ///< Disable the prefetch engine (SYSCLK <= 25 MHz).
#define PFE0CN_PFEN__ENABLED               0x20 ///< Enable the prefetch engine (SYSCLK > 25 MHz).  
                                                                                                    
//------------------------------------------------------------------------------
// PSCTL Enums (Program Store Control @ 0x8F)
//------------------------------------------------------------------------------
#define PSCTL_PSWE__BMASK          0x01 ///< Program Store Write Enable                      
#define PSCTL_PSWE__SHIFT          0x00 ///< Program Store Write Enable                      
#define PSCTL_PSWE__WRITE_DISABLED 0x00 ///< Writes to flash program memory disabled.        
#define PSCTL_PSWE__WRITE_ENABLED  0x01 ///< Writes to flash program memory enabled; the MOVX
                                        ///< write instruction targets flash memory.         
                                                                                             
#define PSCTL_PSEE__BMASK          0x02 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__SHIFT          0x01 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__ERASE_DISABLED 0x00 ///< Flash program memory erasure disabled.          
#define PSCTL_PSEE__ERASE_ENABLED  0x02 ///< Flash program memory erasure enabled.           
                                                                                             
//------------------------------------------------------------------------------
// OSCICL Enums (High Frequency Oscillator Calibration @ 0xB3)
//------------------------------------------------------------------------------
#define OSCICL_OSCICL__FMASK 0x7F ///< Internal Oscillator Calibration
#define OSCICL_OSCICL__SHIFT 0x00 ///< Internal Oscillator Calibration
                                                                      
//------------------------------------------------------------------------------
// OSCICN Enums (High Frequency Oscillator Control @ 0xB2)
//------------------------------------------------------------------------------
#define OSCICN_IFCN__FMASK         0x07 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__SHIFT         0x00 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__HFOSC_DIV_128 0x00 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 128.                                  
#define OSCICN_IFCN__HFOSC_DIV_64  0x01 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 64.                                   
#define OSCICN_IFCN__HFOSC_DIV_32  0x02 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 32.                                   
#define OSCICN_IFCN__HFOSC_DIV_16  0x03 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 16.                                   
#define OSCICN_IFCN__HFOSC_DIV_8   0x04 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 8.                                    
#define OSCICN_IFCN__HFOSC_DIV_4   0x05 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 4.                                    
#define OSCICN_IFCN__HFOSC_DIV_2   0x06 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 2.                                    
#define OSCICN_IFCN__HFOSC_DIV_1   0x07 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 1.                                    
                                                                                              
#define OSCICN_SUSPEND__BMASK      0x20 ///< Oscillator Suspend Enable                        
#define OSCICN_SUSPEND__SHIFT      0x05 ///< Oscillator Suspend Enable                        
#define OSCICN_SUSPEND__DISABLED   0x00 ///< The internal oscillator is not in suspend mode.  
#define OSCICN_SUSPEND__ENABLED    0x20 ///< Place the internal oscillator in suspend mode.   
                                                                                              
#define OSCICN_IFRDY__BMASK        0x40 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__SHIFT        0x06 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__NOT_SET      0x00 ///< The Internal High Frequency Oscillator is not    
                                        ///< running at the programmed frequency.             
#define OSCICN_IFRDY__SET          0x40 ///< The Internal High Frequency Oscillator is running
                                        ///< at the programmed frequency.                     
                                                                                              
#define OSCICN_IOSCEN__BMASK       0x80 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__SHIFT       0x07 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__DISABLED    0x00 ///< Disable the High Frequency Oscillator.           
#define OSCICN_IOSCEN__ENABLED     0x80 ///< Enable the High Frequency Oscillator.            
                                                                                              
//------------------------------------------------------------------------------
// IDA0CN Enums (IDAC0 Control @ 0xB9)
//------------------------------------------------------------------------------
#define IDA0CN_IDAOMD__FMASK              0x03 ///< Output Mode Select                           
#define IDA0CN_IDAOMD__SHIFT              0x00 ///< Output Mode Select                           
#define IDA0CN_IDAOMD__0P25_MA            0x00 ///< 0.25 mA full-scale output current.           
#define IDA0CN_IDAOMD__0P5_MA             0x01 ///< 0.5 mA full-scale output current.            
#define IDA0CN_IDAOMD__1_MA               0x02 ///< 1.0 mA full-scale output current.            
#define IDA0CN_IDAOMD__2_MA               0x03 ///< 2.0 mA full-scale output current.            
                                                                                                 
