ahtn/keyplus/ports/efm8/efm8/mcu/C8051F410/inc/SI_C8051F410_Register_Enums.h
#define IDA0CN_IDARJST__BMASK             0x04 ///< Right Justification Select                   
#define IDA0CN_IDARJST__SHIFT             0x02 ///< Right Justification Select                   
#define IDA0CN_IDARJST__DISABLED          0x00 ///< IDAC0 data in IDA0H:L is left-justified.     
#define IDA0CN_IDARJST__ENABLED           0x04 ///< IDAC0 data in IDA0H:L is right-justified.    
                                                                                                 
#define IDA0CN_IDACM__FMASK               0x70 ///< Update Source Select                         
#define IDA0CN_IDACM__SHIFT               0x04 ///< Update Source Select                         
#define IDA0CN_IDACM__TIMER0              0x00 ///< DAC output updates on Timer 0 overflow.      
#define IDA0CN_IDACM__TIMER1              0x10 ///< DAC output updates on Timer 1 overflow.      
#define IDA0CN_IDACM__TIMER2              0x20 ///< DAC output updates on Timer 2 overflow.      
#define IDA0CN_IDACM__TIMER3              0x30 ///< DAC output updates on Timer 3 overflow.      
#define IDA0CN_IDACM__CNVSTR_RISING_EDGE  0x40 ///< DAC output updates on rising edge of CNVSTR. 
#define IDA0CN_IDACM__CNVSTR_FALLING_EDGE 0x50 ///< DAC output updates on falling edge of CNVSTR.
#define IDA0CN_IDACM__CNVSTR_ANY_EDGE     0x60 ///< DAC output updates on any edge of CNVSTR.    
#define IDA0CN_IDACM__IDA0H               0x70 ///< DAC output updates on write to IDA0H.        
                                                                                                 
#define IDA0CN_IDAEN__BMASK               0x80 ///< IDAC Enable                                  
#define IDA0CN_IDAEN__SHIFT               0x07 ///< IDAC Enable                                  
#define IDA0CN_IDAEN__DISABLED            0x00 ///< Disable IDAC0.                               
#define IDA0CN_IDAEN__ENABLED             0x80 ///< Enable IDAC0.                                
                                                                                                 
//------------------------------------------------------------------------------
// IDA0H Enums (IDAC0 Data High Byte @ 0x97)
//------------------------------------------------------------------------------
#define IDA0H_IDA0__FMASK 0xFF ///< IDAC0 Data High
#define IDA0H_IDA0__SHIFT 0x00 ///< IDAC0 Data High
                                                   
//------------------------------------------------------------------------------
// IDA0L Enums (IDAC0 Data Low Byte @ 0x96)
//------------------------------------------------------------------------------
#define IDA0L_IDA0__FMASK 0xFF ///< IDA0 Data Low
#define IDA0L_IDA0__SHIFT 0x00 ///< IDA0 Data Low
                                                 
//------------------------------------------------------------------------------
// IDA1CN Enums (IDAC1 Control @ 0xB5)
//------------------------------------------------------------------------------
#define IDA1CN_IDAOMD__FMASK              0x03 ///< Output Mode Select                           
#define IDA1CN_IDAOMD__SHIFT              0x00 ///< Output Mode Select                           
#define IDA1CN_IDAOMD__0P25_MA            0x00 ///< 0.25 mA full-scale output current.           
#define IDA1CN_IDAOMD__0P5_MA             0x01 ///< 0.5 mA full-scale output current.            
#define IDA1CN_IDAOMD__1_MA               0x02 ///< 1.0 mA full-scale output current.            
#define IDA1CN_IDAOMD__2_MA               0x03 ///< 2.0 mA full-scale output current.            
                                                                                                 
#define IDA1CN_IDARJST__BMASK             0x04 ///< Right Justification Select                   
#define IDA1CN_IDARJST__SHIFT             0x02 ///< Right Justification Select                   
#define IDA1CN_IDARJST__DISABLED          0x00 ///< IDAC1 data in IDA1H:L is left-justified.     
#define IDA1CN_IDARJST__ENABLED           0x04 ///< IDAC1 data in IDA1H:L is right-justified.    
                                                                                                 
#define IDA1CN_IDACM__FMASK               0x70 ///< Update Source Select                         
#define IDA1CN_IDACM__SHIFT               0x04 ///< Update Source Select                         
#define IDA1CN_IDACM__TIMER0              0x00 ///< DAC output updates on Timer 0 overflow.      
#define IDA1CN_IDACM__TIMER1              0x10 ///< DAC output updates on Timer 1 overflow.      
#define IDA1CN_IDACM__TIMER2              0x20 ///< DAC output updates on Timer 2 overflow.      
#define IDA1CN_IDACM__TIMER3              0x30 ///< DAC output updates on Timer 3 overflow.      
#define IDA1CN_IDACM__CNVSTR_RISING_EDGE  0x40 ///< DAC output updates on rising edge of CNVSTR. 
#define IDA1CN_IDACM__CNVSTR_FALLING_EDGE 0x50 ///< DAC output updates on falling edge of CNVSTR.
#define IDA1CN_IDACM__CNVSTR_ANY_EDGE     0x60 ///< DAC output updates on any edge of CNVSTR.    
#define IDA1CN_IDACM__IDA1H               0x70 ///< DAC output updates on write to IDA1H.        
                                                                                                 
#define IDA1CN_IDAEN__BMASK               0x80 ///< IDAC Enable                                  
#define IDA1CN_IDAEN__SHIFT               0x07 ///< IDAC Enable                                  
#define IDA1CN_IDAEN__DISABLED            0x00 ///< Disable IDAC1.                               
#define IDA1CN_IDAEN__ENABLED             0x80 ///< Enable IDAC1.                                
                                                                                                 
//------------------------------------------------------------------------------
// IDA1H Enums (IDAC1 Data High Byte @ 0xF5)
//------------------------------------------------------------------------------
#define IDA1H_IDA1__FMASK 0xFF ///< IDAC1 Data High
#define IDA1H_IDA1__SHIFT 0x00 ///< IDAC1 Data High
                                                   
//------------------------------------------------------------------------------
// IDA1L Enums (IDAC1 Data Low Byte @ 0xF4)
//------------------------------------------------------------------------------
#define IDA1L_IDA1__FMASK 0xFF ///< IDA1 Data Low
#define IDA1L_IDA1__SHIFT 0x00 ///< IDA1 Data Low
                                                 
//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_ESMB0__BMASK     0x01 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__SHIFT     0x00 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__DISABLED  0x00 ///< Disable all SMB0 interrupts.                      
#define EIE1_ESMB0__ENABLED   0x01 ///< Enable interrupt requests generated by SMB0.      
                                                                                          
#define EIE1_ERTC0__BMASK     0x02 ///< RTC0 Interrupt Enable                             
#define EIE1_ERTC0__SHIFT     0x01 ///< RTC0 Interrupt Enable                             
#define EIE1_ERTC0__DISABLED  0x00 ///< Disable RTC0 interrupts.                          
#define EIE1_ERTC0__ENABLED   0x02 ///< Enable interrupt requests generated by the RTC0   
                                   ///< Alarm and  Oscillator Fail events.                
                                                                                          
