ahtn/keyplus/ports/efm8/efm8/mcu/C8051F410/inc/SI_C8051F410_Register_Enums.h
#define P0MDIN_B5__BMASK   0x20 ///< Port 0 Bit 5 Input Mode                 
#define P0MDIN_B5__SHIFT   0x05 ///< Port 0 Bit 5 Input Mode                 
#define P0MDIN_B5__ANALOG  0x00 ///< P0.5 pin is configured for analog mode. 
#define P0MDIN_B5__DIGITAL 0x20 ///< P0.5 pin is configured for digital mode.
                                                                             
#define P0MDIN_B6__BMASK   0x40 ///< Port 0 Bit 6 Input Mode                 
#define P0MDIN_B6__SHIFT   0x06 ///< Port 0 Bit 6 Input Mode                 
#define P0MDIN_B6__ANALOG  0x00 ///< P0.6 pin is configured for analog mode. 
#define P0MDIN_B6__DIGITAL 0x40 ///< P0.6 pin is configured for digital mode.
                                                                             
#define P0MDIN_B7__BMASK   0x80 ///< Port 0 Bit 7 Input Mode                 
#define P0MDIN_B7__SHIFT   0x07 ///< Port 0 Bit 7 Input Mode                 
#define P0MDIN_B7__ANALOG  0x00 ///< P0.7 pin is configured for analog mode. 
#define P0MDIN_B7__DIGITAL 0x80 ///< P0.7 pin is configured for digital mode.
                                                                             
//------------------------------------------------------------------------------
// P0MDOUT Enums (Port 0 Output Mode @ 0xA4)
//------------------------------------------------------------------------------
#define P0MDOUT_B0__BMASK      0x01 ///< Port 0 Bit 0 Output Mode  
#define P0MDOUT_B0__SHIFT      0x00 ///< Port 0 Bit 0 Output Mode  
#define P0MDOUT_B0__OPEN_DRAIN 0x00 ///< P0.0 output is open-drain.
#define P0MDOUT_B0__PUSH_PULL  0x01 ///< P0.0 output is push-pull. 
                                                                   
#define P0MDOUT_B1__BMASK      0x02 ///< Port 0 Bit 1 Output Mode  
#define P0MDOUT_B1__SHIFT      0x01 ///< Port 0 Bit 1 Output Mode  
#define P0MDOUT_B1__OPEN_DRAIN 0x00 ///< P0.1 output is open-drain.
#define P0MDOUT_B1__PUSH_PULL  0x02 ///< P0.1 output is push-pull. 
                                                                   
#define P0MDOUT_B2__BMASK      0x04 ///< Port 0 Bit 2 Output Mode  
#define P0MDOUT_B2__SHIFT      0x02 ///< Port 0 Bit 2 Output Mode  
#define P0MDOUT_B2__OPEN_DRAIN 0x00 ///< P0.2 output is open-drain.
#define P0MDOUT_B2__PUSH_PULL  0x04 ///< P0.2 output is push-pull. 
                                                                   
#define P0MDOUT_B3__BMASK      0x08 ///< Port 0 Bit 3 Output Mode  
#define P0MDOUT_B3__SHIFT      0x03 ///< Port 0 Bit 3 Output Mode  
#define P0MDOUT_B3__OPEN_DRAIN 0x00 ///< P0.3 output is open-drain.
#define P0MDOUT_B3__PUSH_PULL  0x08 ///< P0.3 output is push-pull. 
                                                                   
#define P0MDOUT_B4__BMASK      0x10 ///< Port 0 Bit 4 Output Mode  
#define P0MDOUT_B4__SHIFT      0x04 ///< Port 0 Bit 4 Output Mode  
#define P0MDOUT_B4__OPEN_DRAIN 0x00 ///< P0.4 output is open-drain.
#define P0MDOUT_B4__PUSH_PULL  0x10 ///< P0.4 output is push-pull. 
                                                                   
#define P0MDOUT_B5__BMASK      0x20 ///< Port 0 Bit 5 Output Mode  
#define P0MDOUT_B5__SHIFT      0x05 ///< Port 0 Bit 5 Output Mode  
#define P0MDOUT_B5__OPEN_DRAIN 0x00 ///< P0.5 output is open-drain.
#define P0MDOUT_B5__PUSH_PULL  0x20 ///< P0.5 output is push-pull. 
                                                                   
#define P0MDOUT_B6__BMASK      0x40 ///< Port 0 Bit 6 Output Mode  
#define P0MDOUT_B6__SHIFT      0x06 ///< Port 0 Bit 6 Output Mode  
#define P0MDOUT_B6__OPEN_DRAIN 0x00 ///< P0.6 output is open-drain.
#define P0MDOUT_B6__PUSH_PULL  0x40 ///< P0.6 output is push-pull. 
                                                                   
#define P0MDOUT_B7__BMASK      0x80 ///< Port 0 Bit 7 Output Mode  
#define P0MDOUT_B7__SHIFT      0x07 ///< Port 0 Bit 7 Output Mode  
#define P0MDOUT_B7__OPEN_DRAIN 0x00 ///< P0.7 output is open-drain.
#define P0MDOUT_B7__PUSH_PULL  0x80 ///< P0.7 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// P0ODEN Enums (Port 0 Overdrive Mode @ 0xB0)
//------------------------------------------------------------------------------
#define P0ODEN_B0__BMASK          0x01 ///< Port 0 Bit 0 Overdrive Mode                     
#define P0ODEN_B0__SHIFT          0x00 ///< Port 0 Bit 0 Overdrive Mode                     
#define P0ODEN_B0__NORMAL         0x00 ///< Configure P0.0 to normal overdrive mode.        
#define P0ODEN_B0__HIGH_IMPEDANCE 0x01 ///< Configure P0.0 to high-impedance overdrive mode.
                                                                                            
#define P0ODEN_B1__BMASK          0x02 ///< Port 0 Bit 1 Overdrive Mode                     
#define P0ODEN_B1__SHIFT          0x01 ///< Port 0 Bit 1 Overdrive Mode                     
#define P0ODEN_B1__NORMAL         0x00 ///< Configure P0.1 to normal overdrive mode.        
#define P0ODEN_B1__HIGH_IMPEDANCE 0x02 ///< Configure P0.1 to high-impedance overdrive mode.
                                                                                            
#define P0ODEN_B2__BMASK          0x04 ///< Port 0 Bit 2 Overdrive Mode                     
#define P0ODEN_B2__SHIFT          0x02 ///< Port 0 Bit 2 Overdrive Mode                     
#define P0ODEN_B2__NORMAL         0x00 ///< Configure P0.2 to normal overdrive mode.        
#define P0ODEN_B2__HIGH_IMPEDANCE 0x04 ///< Configure P0.2 to high-impedance overdrive mode.
                                                                                            
#define P0ODEN_B3__BMASK          0x08 ///< Port 0 Bit 3 Overdrive Mode                     
#define P0ODEN_B3__SHIFT          0x03 ///< Port 0 Bit 3 Overdrive Mode                     
#define P0ODEN_B3__NORMAL         0x00 ///< Configure P0.3 to normal overdrive mode.        
#define P0ODEN_B3__HIGH_IMPEDANCE 0x08 ///< Configure P0.3 to high-impedance overdrive mode.
                                                                                            
#define P0ODEN_B4__BMASK          0x10 ///< Port 0 Bit 4 Overdrive Mode                     
#define P0ODEN_B4__SHIFT          0x04 ///< Port 0 Bit 4 Overdrive Mode                     
#define P0ODEN_B4__NORMAL         0x00 ///< Configure P0.4 to normal overdrive mode.        
#define P0ODEN_B4__HIGH_IMPEDANCE 0x10 ///< Configure P0.4 to high-impedance overdrive mode.
                                                                                            
#define P0ODEN_B5__BMASK          0x20 ///< Port 0 Bit 5 Overdrive Mode                     
#define P0ODEN_B5__SHIFT          0x05 ///< Port 0 Bit 5 Overdrive Mode                     
#define P0ODEN_B5__NORMAL         0x00 ///< Configure P0.5 to normal overdrive mode.        
#define P0ODEN_B5__HIGH_IMPEDANCE 0x20 ///< Configure P0.5 to high-impedance overdrive mode.
                                                                                            
