ahtn/keyplus/ports/efm8/efm8/mcu/C8051F410/inc/SI_C8051F410_Register_Enums.h
#define RSTSRC_MCDRSF__BMASK   0x04 ///< Missing Clock Detector Enable and Flag                               
#define RSTSRC_MCDRSF__SHIFT   0x02 ///< Missing Clock Detector Enable and Flag                               
#define RSTSRC_MCDRSF__NOT_SET 0x00 ///< A missing clock detector reset did not occur.                        
#define RSTSRC_MCDRSF__SET     0x04 ///< A missing clock detector reset occurred.                             
                                                                                                              
#define RSTSRC_WDTRSF__BMASK   0x08 ///< Watchdog Timer Reset Flag                                            
#define RSTSRC_WDTRSF__SHIFT   0x03 ///< Watchdog Timer Reset Flag                                            
#define RSTSRC_WDTRSF__NOT_SET 0x00 ///< A watchdog timer overflow reset did not occur.                       
#define RSTSRC_WDTRSF__SET     0x08 ///< A watchdog timer overflow reset occurred.                            
                                                                                                              
#define RSTSRC_SWRSF__BMASK    0x10 ///< Software Reset Force and Flag                                        
#define RSTSRC_SWRSF__SHIFT    0x04 ///< Software Reset Force and Flag                                        
#define RSTSRC_SWRSF__NOT_SET  0x00 ///< A software reset did not occur.                                      
#define RSTSRC_SWRSF__SET      0x10 ///< A software reset occurred.                                           
                                                                                                              
#define RSTSRC_C0RSEF__BMASK   0x20 ///< Comparator0 Reset Enable and Flag                                    
#define RSTSRC_C0RSEF__SHIFT   0x05 ///< Comparator0 Reset Enable and Flag                                    
#define RSTSRC_C0RSEF__NOT_SET 0x00 ///< A Comparator 0 reset did not occur.                                  
#define RSTSRC_C0RSEF__SET     0x20 ///< A Comparator 0 reset occurred.                                       
                                                                                                              
#define RSTSRC_FERROR__BMASK   0x40 ///< Flash Error Reset Flag                                               
#define RSTSRC_FERROR__SHIFT   0x06 ///< Flash Error Reset Flag                                               
#define RSTSRC_FERROR__NOT_SET 0x00 ///< A flash error reset did not occur.                                   
#define RSTSRC_FERROR__SET     0x40 ///< A flash error reset occurred.                                        
                                                                                                              
#define RSTSRC_RTC0RE__BMASK   0x80 ///< RTC Reset Enable and Flag                                            
#define RSTSRC_RTC0RE__SHIFT   0x07 ///< RTC Reset Enable and Flag                                            
#define RSTSRC_RTC0RE__NOT_SET 0x00 ///< A RTC alarm or oscillator fail reset did not                         
                                    ///< occur.                                                               
#define RSTSRC_RTC0RE__SET     0x80 ///< A RTC alarm or oscillator fail reset occurred.                       
                                                                                                              
//------------------------------------------------------------------------------
// ALARM0 Enums (RTC Alarm Programmed Value 0 @ 0x08)
//------------------------------------------------------------------------------
#define ALARM0_ALARM0__FMASK 0xFF ///< RTC Alarm Programmed Value 0
#define ALARM0_ALARM0__SHIFT 0x00 ///< RTC Alarm Programmed Value 0
                                                                   
//------------------------------------------------------------------------------
// ALARM1 Enums (RTC Alarm Programmed Value 1 @ 0x09)
//------------------------------------------------------------------------------
#define ALARM1_ALARM1__FMASK 0xFF ///< RTC Alarm Programmed Value 1
#define ALARM1_ALARM1__SHIFT 0x00 ///< RTC Alarm Programmed Value 1
                                                                   
//------------------------------------------------------------------------------
// ALARM2 Enums (RTC Alarm Programmed Value 2 @ 0x0A)
//------------------------------------------------------------------------------
#define ALARM2_ALARM2__FMASK 0xFF ///< RTC Alarm Programmed Value 2
#define ALARM2_ALARM2__SHIFT 0x00 ///< RTC Alarm Programmed Value 2
                                                                   
//------------------------------------------------------------------------------
// ALARM3 Enums (RTC Alarm Programmed Value 3 @ 0x0B)
//------------------------------------------------------------------------------
#define ALARM3_ALARM3__FMASK 0xFF ///< RTC Alarm Programmed Value 3
#define ALARM3_ALARM3__SHIFT 0x00 ///< RTC Alarm Programmed Value 3
                                                                   
//------------------------------------------------------------------------------
// ALARM4 Enums (RTC Alarm Programmed Value 4 @ 0x0C)
//------------------------------------------------------------------------------
#define ALARM4_ALARM4__FMASK 0xFF ///< RTC Alarm Programmed Value 4
#define ALARM4_ALARM4__SHIFT 0x00 ///< RTC Alarm Programmed Value 4
                                                                   
//------------------------------------------------------------------------------
// ALARM5 Enums (RTC Alarm Programmed Value 5 @ 0x0D)
//------------------------------------------------------------------------------
#define ALARM5_ALARM5__FMASK 0xFF ///< RTC Alarm Programmed Value 5
#define ALARM5_ALARM5__SHIFT 0x00 ///< RTC Alarm Programmed Value 5
                                                                   
//------------------------------------------------------------------------------
// CAPTURE0 Enums (RTC Timer Capture 0 @ 0x00)
//------------------------------------------------------------------------------
#define CAPTURE0_CAPTURE0__FMASK 0xFF ///< RTC Timer Capture 0
#define CAPTURE0_CAPTURE0__SHIFT 0x00 ///< RTC Timer Capture 0
                                                              
//------------------------------------------------------------------------------
// CAPTURE1 Enums (RTC Timer Capture 1 @ 0x01)
//------------------------------------------------------------------------------
#define CAPTURE1_CAPTURE1__FMASK 0xFF ///< RTC Timer Capture 1
#define CAPTURE1_CAPTURE1__SHIFT 0x00 ///< RTC Timer Capture 1
                                                              
//------------------------------------------------------------------------------
// CAPTURE2 Enums (RTC Timer Capture 2 @ 0x02)
//------------------------------------------------------------------------------
#define CAPTURE2_CAPTURE2__FMASK 0xFF ///< RTC Timer Capture 2
#define CAPTURE2_CAPTURE2__SHIFT 0x00 ///< RTC Timer Capture 2
                                                              
//------------------------------------------------------------------------------
// CAPTURE3 Enums (RTC Timer Capture 3 @ 0x03)
//------------------------------------------------------------------------------
#define CAPTURE3_CAPTURE3__FMASK 0xFF ///< RTC Timer Capture 3
#define CAPTURE3_CAPTURE3__SHIFT 0x00 ///< RTC Timer Capture 3
                                                              
//------------------------------------------------------------------------------
// CAPTURE4 Enums (RTC Timer Capture 4 @ 0x04)
//------------------------------------------------------------------------------
#define CAPTURE4_CAPTURE4__FMASK 0xFF ///< RTC Timer Capture 4
#define CAPTURE4_CAPTURE4__SHIFT 0x00 ///< RTC Timer Capture 4
                                                              
//------------------------------------------------------------------------------
// CAPTURE5 Enums (RTC Timer Capture 5 @ 0x05)
//------------------------------------------------------------------------------
#define CAPTURE5_CAPTURE5__FMASK 0xFF ///< RTC Timer Capture 5
#define CAPTURE5_CAPTURE5__SHIFT 0x00 ///< RTC Timer Capture 5
                                                              
//------------------------------------------------------------------------------
// RAMADDR Enums (RTC Backup RAM Address @ 0x0E)
//------------------------------------------------------------------------------
#define RAMADDR_RAMADDR__FMASK 0xFF ///< RTC Backup RAM Address
#define RAMADDR_RAMADDR__SHIFT 0x00 ///< RTC Backup RAM Address
                                                               
//------------------------------------------------------------------------------
// RAMDATA Enums (RTC Backup RAM Data @ 0x0F)
//------------------------------------------------------------------------------
#define RAMDATA_RAMDATA__FMASK 0xFF ///< RTC Backup RAM Data
#define RAMDATA_RAMDATA__SHIFT 0x00 ///< RTC Backup RAM Data
                                                            
//------------------------------------------------------------------------------
// RTC0ADR Enums (RTC Address @ 0xAC)
//------------------------------------------------------------------------------
#define RTC0ADR_ADDR__FMASK             0x0F ///< RTC Indirect Register Address                     
#define RTC0ADR_ADDR__SHIFT             0x00 ///< RTC Indirect Register Address                     
#define RTC0ADR_ADDR__CAPTURE0          0x00 ///< Select the CAPTURE0 register.                     
#define RTC0ADR_ADDR__CAPTURE1          0x01 ///< Select the CAPTURE1 register.                     
#define RTC0ADR_ADDR__CAPTURE2          0x02 ///< Select the CAPTURE2 register.                     
#define RTC0ADR_ADDR__CAPTURE3          0x03 ///< Select the CAPTURE3 register.                     
#define RTC0ADR_ADDR__CAPTURE4          0x04 ///< Select the CAPTURE4 register.                     
#define RTC0ADR_ADDR__CAPTURE5          0x05 ///< Select the CAPTURE5 register.                     
#define RTC0ADR_ADDR__RTC0CN            0x06 ///< Select the RTC0CN register.                       
#define RTC0ADR_ADDR__RTC0XCN           0x07 ///< Select the RTC0XCN register.                      
#define RTC0ADR_ADDR__ALARM0            0x08 ///< Select the ALARM0 register.                       
#define RTC0ADR_ADDR__ALARM1            0x09 ///< Select the ALARM1 register.                       
#define RTC0ADR_ADDR__ALARM2            0x0A ///< Select the ALARM2 register.                       
#define RTC0ADR_ADDR__ALARM3            0x0B ///< Select the ALARM3 register.                       
#define RTC0ADR_ADDR__ALARM4            0x0C ///< Select the ALARM4 register.                       
#define RTC0ADR_ADDR__ALARM5            0x0D ///< Select the ALARM5 register.                       
#define RTC0ADR_ADDR__RAMADDR           0x0E ///< Select the RAMADDR register.                      
#define RTC0ADR_ADDR__RAMDATA           0x0F ///< Select the RAMDATA register.                      
                                                                                                    
#define RTC0ADR_SHORT__BMASK            0x10 ///< Short Strobe Enable                               
#define RTC0ADR_SHORT__SHIFT            0x04 ///< Short Strobe Enable                               
#define RTC0ADR_SHORT__DISABLED         0x00 ///< Disable short strobe.                             
#define RTC0ADR_SHORT__ENABLED          0x10 ///< Enable short strobe.                              
                                                                                                    
#define RTC0ADR_VREGEN__BMASK           0x20 ///< Backup Supply Voltage Regulator Enable            
#define RTC0ADR_VREGEN__SHIFT           0x05 ///< Backup Supply Voltage Regulator Enable            
#define RTC0ADR_VREGEN__BACKUP_DISABLED 0x00 ///< Disable the backup supply voltage regulator. The  
                                             ///< RTC is powered from VDD.                          
#define RTC0ADR_VREGEN__BACKUP_ENABLED  0x20 ///< Force the backup supply voltage regulator enabled.
                                             ///< The RTC is powered from VRTC-BACKUP.              
                                                                                                    
#define RTC0ADR_AUTORD__BMASK           0x40 ///< RTC Interface Autoread Enable                     
#define RTC0ADR_AUTORD__SHIFT           0x06 ///< RTC Interface Autoread Enable                     
#define RTC0ADR_AUTORD__DISABLED        0x00 ///< Disable autoread. Firmware must write the BUSY bit
                                             ///< for each RTC indirect read operation.             
#define RTC0ADR_AUTORD__ENABLED         0x40 ///< Enable autoread. The next RTC indirect read       
                                             ///< operation is initiated when firmware reads the    
                                             ///< RTC0DAT register.                                 
                                                                                                    
#define RTC0ADR_BUSY__BMASK             0x80 ///< RTC Interface Busy Indicator                      
#define RTC0ADR_BUSY__SHIFT             0x07 ///< RTC Interface Busy Indicator                      
#define RTC0ADR_BUSY__NOT_SET           0x00 ///< The RTC interface is not busy.                    
#define RTC0ADR_BUSY__SET               0x80 ///< The RTC interface is busy.                        
                                                                                                    
//------------------------------------------------------------------------------
// RTC0CN Enums (RTC Control @ 0x06)
//------------------------------------------------------------------------------
#define RTC0CN_RTCCAP__BMASK    0x01 ///< RTC Timer Capture                               
#define RTC0CN_RTCCAP__SHIFT    0x00 ///< RTC Timer Capture                               
#define RTC0CN_RTCCAP__NOT_SET  0x00 ///< Do not start a capture operation.               
#define RTC0CN_RTCCAP__SET      0x01 ///< Start a capture operation.                      
                                                                                          
#define RTC0CN_RTCSET__BMASK    0x02 ///< RTC Timer Set                                   
#define RTC0CN_RTCSET__SHIFT    0x01 ///< RTC Timer Set                                   
#define RTC0CN_RTCSET__NOT_SET  0x00 ///< Do not start a set operation.                   
#define RTC0CN_RTCSET__SET      0x02 ///< Start a set operation.                          
                                                                                          
