ahtn/keyplus/ports/efm8/efm8/mcu/C8051F410/inc/SI_C8051F410_Register_Enums.h
#define SPI0CN_NSSMD__FMASK                  0x0C ///< Slave Select Mode                                 
#define SPI0CN_NSSMD__SHIFT                  0x02 ///< Slave Select Mode                                 
#define SPI0CN_NSSMD__3_WIRE                 0x00 ///< 3-Wire Slave or 3-Wire Master Mode. NSS signal is 
                                                  ///< not routed to a port pin.                         
#define SPI0CN_NSSMD__4_WIRE_SLAVE           0x04 ///< 4-Wire Slave or Multi-Master Mode. NSS is an input
                                                  ///< to the device.                                    
#define SPI0CN_NSSMD__4_WIRE_MASTER_NSS_LOW  0x08 ///< 4-Wire Single-Master Mode. NSS is an output and   
                                                  ///< logic low.                                        
#define SPI0CN_NSSMD__4_WIRE_MASTER_NSS_HIGH 0x0C ///< 4-Wire Single-Master Mode. NSS is an output and   
                                                  ///< logic high.                                       
                                                                                                         
#define SPI0CN_RXOVRN__BMASK                 0x10 ///< Receive Overrun Flag                              
#define SPI0CN_RXOVRN__SHIFT                 0x04 ///< Receive Overrun Flag                              
#define SPI0CN_RXOVRN__NOT_SET               0x00 ///< A receive overrun did not occur.                  
#define SPI0CN_RXOVRN__SET                   0x10 ///< A receive overrun occurred.                       
                                                                                                         
#define SPI0CN_MODF__BMASK                   0x20 ///< Mode Fault Flag                                   
#define SPI0CN_MODF__SHIFT                   0x05 ///< Mode Fault Flag                                   
#define SPI0CN_MODF__NOT_SET                 0x00 ///< A master collision did not occur.                 
#define SPI0CN_MODF__SET                     0x20 ///< A master collision occurred.                      
                                                                                                         
#define SPI0CN_WCOL__BMASK                   0x40 ///< Write Collision Flag                              
#define SPI0CN_WCOL__SHIFT                   0x06 ///< Write Collision Flag                              
#define SPI0CN_WCOL__NOT_SET                 0x00 ///< A write collision did not occur.                  
#define SPI0CN_WCOL__SET                     0x40 ///< A write collision occurred.                       
                                                                                                         
#define SPI0CN_SPIF__BMASK                   0x80 ///< SPI0 Interrupt Flag                               
#define SPI0CN_SPIF__SHIFT                   0x07 ///< SPI0 Interrupt Flag                               
#define SPI0CN_SPIF__NOT_SET                 0x00 ///< A data transfer has not completed since the last  
                                                  ///< time SPIF was cleared.                            
#define SPI0CN_SPIF__SET                     0x80 ///< A data transfer completed.                        
                                                                                                         
//------------------------------------------------------------------------------
// SPI0DAT Enums (SPI0 Data @ 0xA3)
//------------------------------------------------------------------------------
#define SPI0DAT_SPI0DAT__FMASK 0xFF ///< SPI0 Transmit and Receive Data
#define SPI0DAT_SPI0DAT__SHIFT 0x00 ///< SPI0 Transmit and Receive Data
                                                                       
//------------------------------------------------------------------------------
// TH0 Enums (Timer 0 High Byte @ 0x8C)
//------------------------------------------------------------------------------
#define TH0_TH0__FMASK 0xFF ///< Timer 0 High Byte
#define TH0_TH0__SHIFT 0x00 ///< Timer 0 High Byte
                                                  
//------------------------------------------------------------------------------
// TH1 Enums (Timer 1 High Byte @ 0x8D)
//------------------------------------------------------------------------------
#define TH1_TH1__FMASK 0xFF ///< Timer 1 High Byte
#define TH1_TH1__SHIFT 0x00 ///< Timer 1 High Byte
                                                  
//------------------------------------------------------------------------------
// TL0 Enums (Timer 0 Low Byte @ 0x8A)
//------------------------------------------------------------------------------
#define TL0_TL0__FMASK 0xFF ///< Timer 0 Low Byte
#define TL0_TL0__SHIFT 0x00 ///< Timer 0 Low Byte
                                                 
//------------------------------------------------------------------------------
// TL1 Enums (Timer 1 Low Byte @ 0x8B)
//------------------------------------------------------------------------------
#define TL1_TL1__FMASK 0xFF ///< Timer 1 Low Byte
#define TL1_TL1__SHIFT 0x00 ///< Timer 1 Low Byte
                                                 
//------------------------------------------------------------------------------
// TMR2CN Enums (Timer 2 Control @ 0xC8)
//------------------------------------------------------------------------------
#define TMR2CN_T2XCLK__BMASK                      0x01 ///< Timer 2 External Clock Select                     
#define TMR2CN_T2XCLK__SHIFT                      0x00 ///< Timer 2 External Clock Select                     
#define TMR2CN_T2XCLK__SYSCLK_DIV_12              0x00 ///< Timer 2 clock is the system clock divided by 12.  
#define TMR2CN_T2XCLK__T2RCLK                     0x01 ///< Timer 2 clock is the clock defined by the T2RCLK  
                                                       ///< bit.                                              
                                                                                                              
#define TMR2CN_T2RCLK__BMASK                      0x02 ///< Timer 2 Capture Mode                              
#define TMR2CN_T2RCLK__SHIFT                      0x01 ///< Timer 2 Capture Mode                              
#define TMR2CN_T2RCLK__EXTOSC_DIV_8_CAP_RTC_DIV_8 0x00 ///< Capture trigger is RTC / 8. If T2XCLK = 1 and T2ML
                                                       ///< = 0, external clock is EXTOSC / 8.                
#define TMR2CN_T2RCLK__RTC_DIV_8_CAP_EXTOSC_DIV_8 0x02 ///< Capture trigger is EXTOSC / 8. If T2XCLK = 1 and  
                                                       ///< T2ML = 0, external clock is RTC / 8.              
                                                                                                              
#define TMR2CN_TR2__BMASK                         0x04 ///< Timer 2 Run Control                               
#define TMR2CN_TR2__SHIFT                         0x02 ///< Timer 2 Run Control                               
#define TMR2CN_TR2__STOP                          0x00 ///< Stop Timer 2.                                     
#define TMR2CN_TR2__RUN                           0x04 ///< Start Timer 2 running.                            
                                                                                                              
#define TMR2CN_T2SPLIT__BMASK                     0x08 ///< Timer 2 Split Mode Enable                         
#define TMR2CN_T2SPLIT__SHIFT                     0x03 ///< Timer 2 Split Mode Enable                         
#define TMR2CN_T2SPLIT__16_BIT_RELOAD             0x00 ///< Timer 2 operates in 16-bit auto-reload mode.      
#define TMR2CN_T2SPLIT__8_BIT_RELOAD              0x08 ///< Timer 2 operates as two 8-bit auto-reload timers. 
                                                                                                              
#define TMR2CN_TF2CEN__BMASK                      0x10 ///< Timer 2 Capture Enable                            
#define TMR2CN_TF2CEN__SHIFT                      0x04 ///< Timer 2 Capture Enable                            
#define TMR2CN_TF2CEN__DISABLED                   0x00 ///< Disable capture mode.                             
#define TMR2CN_TF2CEN__ENABLED                    0x10 ///< Enable capture mode.                              
                                                                                                              
#define TMR2CN_TF2LEN__BMASK                      0x20 ///< Timer 2 Low Byte Interrupt Enable                 
#define TMR2CN_TF2LEN__SHIFT                      0x05 ///< Timer 2 Low Byte Interrupt Enable                 
#define TMR2CN_TF2LEN__DISABLED                   0x00 ///< Disable low byte interrupts.                      
#define TMR2CN_TF2LEN__ENABLED                    0x20 ///< Enable low byte interrupts.                       
                                                                                                              
