ahtn/keyplus/ports/efm8/efm8/mcu/C8051F410/inc/SI_C8051F410_Register_Enums.h
#define REF0CN_IDAMRG__BMASK        0x80 ///< IDAC Output Merge Select                          
#define REF0CN_IDAMRG__SHIFT        0x07 ///< IDAC Output Merge Select                          
#define REF0CN_IDAMRG__SEPARATED    0x00 ///< IDAC1 output is separate from the IDAC0 output.   
#define REF0CN_IDAMRG__MERGED       0x80 ///< IDAC1 output is merged with the IDAC0 output on   
                                         ///< the same pin as IDAC0.0.                          
                                                                                                
//------------------------------------------------------------------------------
// REG0CN Enums (Voltage Regulator Control @ 0xC9)
//------------------------------------------------------------------------------
#define REG0CN_DROPOUT__BMASK   0x01 ///< Voltage Regulator Dropout Indicator     
#define REG0CN_DROPOUT__SHIFT   0x00 ///< Voltage Regulator Dropout Indicator     
#define REG0CN_DROPOUT__NOT_SET 0x00 ///< Voltage Regulator is not in dropout.    
#define REG0CN_DROPOUT__SET     0x01 ///< Voltage Regulator is in or near dropout.
                                                                                  
#define REG0CN_REGMD__BMASK     0x10 ///< Voltage Regulator Output Mode           
#define REG0CN_REGMD__SHIFT     0x04 ///< Voltage Regulator Output Mode           
#define REG0CN_REGMD__2P1       0x00 ///< Voltage Regulator output is 2.1 V.      
#define REG0CN_REGMD__2P5       0x10 ///< Voltage Regulator output is 2.5 V.      
                                                                                  
#define REG0CN_REGDIS__BMASK    0x80 ///< Voltage Regulator Disable               
#define REG0CN_REGDIS__SHIFT    0x07 ///< Voltage Regulator Disable               
#define REG0CN_REGDIS__ENABLED  0x00 ///< Enable the Voltage Regulator.           
#define REG0CN_REGDIS__DISABLED 0x80 ///< Disable the Voltage Regulator.          
                                                                                  
//------------------------------------------------------------------------------
// EMI0CN Enums (External Memory Interface Control @ 0xAA)
//------------------------------------------------------------------------------
#define EMI0CN_PGSEL__FMASK 0x07 ///< XRAM Page Select
#define EMI0CN_PGSEL__SHIFT 0x00 ///< XRAM Page Select
                                                      
#endif // SI_C8051F410_REGISTER_ENUMS_H
//-eof--------------------------------------------------------------------------

